Repository: SeanSpawn/MicroHostsEditor
Catalog: docs/source/locale/*/LC_MESSAGES/using-application.po
Languages: ru

source: Using application
ru: Работа с программой

source: Editing Hosts file
ru: Редактирование файла Hosts

source: In the first column **IP-address** you must enter a valid IP address (eg. ``127.0.0.1``), in the second **Hostname**, the hostname (eg. ``localhost``), and in the third **Comment** -- optional comment, if necessary. Both IPv4 and IPv6 are supported.
ru: В первом столбце **IP-адрес** вы должны указать действительный IP-адрес (например, ``127.0.0.1``), во втором -- **Доменное имя** -- соответствующее доменное имя (например, ``localhost``), а в третьем -- **Комментарий** -- опциональный комментарий, если это необходимо. Поддерживаются как IPv4, так и IPv6.

source: Multiple hostnames are allowed in one entry. Use a space as a separator. Quotation marks or wildcards are strictly prohibited. Inline commentaries are also forbidden. Use a separate column for this.
ru: В одной строке разрешено указывать несколько доменных имён, разделяя их при помощи пробела. Кавычки и символы подстановки запрещены. Встроенные комментарии также запрещены. Используйте специально выделенный столбец для этого.

source: To add a new row, just start typing text in the last cell.
ru: Чтобы добавить новую строку просто начинайте набирать текст в последней пустой строке программы.

source: To edit the contents of a cell, double-click on it or simply start typing a new value.
ru: Чтобы отредактировать содержимое ячейки, дважды кликните по ней мышью, либо просто начните вводить новое значение.

source: If you want to edit Hosts file as a plain text file, click **Open in text editor** in the **Advanced** menu. The file will be loaded with a :ref:`selected <settings-advanced>` (or system default) text editor.
ru: Если вы хотите редактировать файл Hosts в текстовом редакторе, выберите **Открыть в текстовом редакторе** из меню **Дополнительно**. Файл будет загружен в :ref:`выбранном текстовом редакторе <settings-advanced>` (или по умолчанию для текущей платформы).

source: Reloading Hosts file
ru: Обновление файла Hosts

source: Click the **Refresh** button on the main toolbar, or press **F5** button on your keyboard to reload the Hosts file from disk.
ru: Нажмите кнопку **Обновить** на главной панели инструментов, либо клавишу **F5** на клавиатуре, чтобы перечитать файл Hosts с диска.

source: Any unsaved changes will be lost.
ru: Все не сохранённые изменения будут потеряны.

source: Saving Hosts file
ru: Сохранение файла Hosts

source: Click the **Save** button on the main toolbar, or press **Ctrl + S** key combination on your keyboard to save the Hosts file to disk.
ru: Нажмите кнопку **Сохранить** на главной панели инструментов, либо комбинацию **Ctrl + S** на клавиатуре, чтобы сохранить файл Hosts на диск.

source: Importing Hosts file entries
ru: Импортирование записей файла Hosts

source: If you want to import entries from external file, you can use the **File** -- **Import** menu item.
ru: Если вы хотите импортировать записи из внешнего файла, вы можете использовать пункт меню **Файл** -- **Импорт**.

source: Select a text file using the standard OS dialog and click the **Open** button.
ru: Выберите текстовый файл при помощи стандартного для ОС диалога и нажмите кнопку **Открыть**.

source: Only one file can be imported at once with an unlimited number of entries.
ru: Только один файл может быть импортирован за раз. Количество строк при этом не ограничено.

source: Exporting Hosts file entries
ru: Экспортирование записей файла Hosts

source: If you want to export entries to external file, you can use the **File** -- **Export** menu item.
ru: Если вы хотите экспортировать записи в внешний файл, вы можете использовать пункт меню **Файл** -- **Экспорт**.

source: Select a text file using the standard OS dialog and click the **Save** button.
ru: Выберите текстовый файл при помощи стандартного для ОС диалога и нажмите кнопку **Сохранить**.

source: Hosts file encoding
ru: Кодировка файла Hosts

source: The application supports the following Hosts encodings:
ru: Приложение поддерживает следующие кодировки файла Hosts:

source: System default;
ru: По умолчанию;

source: Unicode.
ru: Юникод.

source: You can select the preferred encoding from the **Advanced** -- **File encoding** menu.
ru: Вы можете выбрать предпочитаемую кодировку при помощи меню **Дополнительно** -- **Кодировка файла**.

source: This setting will affect all actions and will persist between program runs.
ru: Этот параметр повлияет на все выполняемые действия и сохранится между запусками программы.

source: Cut to clipboard
ru: Вырезать в буфер обмена

source: You can select and cut any entries to the clipboard by using the **Edit** -- **Cut** menu item, the **Cut** context menu item or the **Ctrl+X** :ref:`hotkey <usage-hotkeys>`.
ru: Вы можете выделить и вырезать в буфер обмена любое количество элементов при помощи команды меню **Правка** -- **Вырезать**, пункта **Вырезать** контекстного меню, либо :ref:`клавиатурной комбинацией <usage-hotkeys>` **Ctrl+X**.

source: The data will be copied as tab-delimited plain text, removed from the table, and can be pasted into any application.
ru: Данные будут скопированы в виде простого текста с разделителем в виде табуляции, удалены из редактора, и могут быть вставлены в любое приложение.

source: Copy to clipboard
ru: Скопировать в буфер обмена

source: You can select and copy any entries to the clipboard by using the **Edit** -- **Copy** menu item, the **Copy** context menu item or the **Ctrl+C** :ref:`hotkey <usage-hotkeys>`.
ru: Вы можете выделить и скопировать в буфер обмена любое количество элементов при помощи команды меню **Правка** -- **Копировать**, пункта **Копировать** контекстного меню, либо :ref:`клавиатурной комбинацией <usage-hotkeys>` **Ctrl+C**.

source: The data will be copied as a tab-delimited plain text, and can be pasted into any application.
ru: Данные будут скопированы в виде простого текста с разделителем в виде табуляции, и могут быть вставлены в любое приложение.

source: Paste from clipboard
ru: Вставка из буфера обмена

source: You can paste one or more entries from the clipboard by using the **Edit** -- **Paste** menu item, the **Paste** context menu item or the **Ctrl+V** :ref:`hotkey <usage-hotkeys>`.
ru: Вы можете вставить один или более элементов из буфера обмена при помощи команды меню **Правка** -- **Вставить**, пункта **Вставить** контекстного меню, либо :ref:`клавиатурной комбинацией <usage-hotkeys>` **Ctrl+V**.

source: If only one cell is selected, insertion at the selection point will be used, otherwise the alternative mode of inserting the entire row will be used.
ru: Если выделена только одна ячейка, будет использоваться режим вставки в точке выделения, иначе задействуется альтернативный режим вставки целой строки.

source: If you want to replace an existing row, you must first select it by clicking on the row selector (first column). Otherwise it will be inserted at the end of the table.
ru: Если вы хотите заменить существующую строку, то сначала необходимо выделить её, кликнув по селектору строки (первый столбец). В противном случае она будет вставлена в конец таблицы.

source: Removing rows
ru: Удаление строк

source: You can select and remove one or more rows by using the **Edit** -- **Delete** menu item, the **Delete** context menu item or the **Shift+Del** :ref:`hotkey <usage-hotkeys>`.
ru: Вы можете выделить и удалить одну или более строк при помощи команды меню **Правка** -- **Удалить**, пункта **Удалить** контекстного меню, либо :ref:`клавиатурной комбинацией <usage-hotkeys>` **Shift+Del**.

source: Status bar
ru: Строка состояния

source: The status bar displays the following:
ru: В строке состояния отображается следующая информация:

source: full path to the active Hosts file. Click to show it in the default file manager;
ru: полный путь к активному файлу Hosts. Нажмите, чтобы отобразить его в файловом менеджере по умолчанию;

source: current operating mode:
ru: текущий режим работы:

source: **R/O** -- read-only. Click to restart the program with administrator rights.
ru: **R/O** -- только для чтения. Нажмите, чтобы перезапустить программу с правами администратора.

source: **R/W** -- read and write.
ru: **R/W** -- чтение и запись.

source: Hotkeys
ru: Клавиатурные комбинации

source: Hotkeys can be used to control the application.
ru: Для работы с программой могут быть использованы "горячие клавиши".

source: Currently supported keyboard combinations:
ru: В настоящее время поддерживаются следующие клавиатурные комбинации:

source: **F1** -- show offline help;
ru: **F1** -- показать справочную систему;

source: **F5** -- :ref:`reload <usage-reload>` the Hosts file from disk;
ru: **F5** -- :ref:`перечитать <usage-reload>` файл Hosts с диска;

source: **Ctrl+S** -- :ref:`save <usage-save>` the Hosts file to disk;
ru: **Ctrl+S** -- :ref:`сохранить <usage-save>` изменения в файле Hosts на диск;

source: **Ctrl+Q** -- quit application;
ru: **Ctrl+Q** -- выйти из программы;

source: **Ctrl+X** -- :ref:`cut <usage-clipboard-cut>` the selected cell data to the clipboard;
ru: **Ctrl+X** -- :ref:`вырезать <usage-clipboard-cut>` содержимое выделенных ячеек в буфер обмена;

source: **Ctrl+C** -- :ref:`copy <usage-clipboard-copy>` the selected cell data to the clipboard;
ru: **Ctrl+C** -- :ref:`скопировать <usage-clipboard-copy>` содержимое выделенных ячеек в буфер обмена;

source: **Ctrl+V** -- :ref:`paste <usage-clipboard-paste>` data from the clipboard to the selected cell or row;
ru: **Ctrl+V** -- :ref:`вставить <usage-clipboard-paste>` содержимое буфера обмена в выделенную ячейку или строку;

source: **Shift+Del** -- :ref:`remove <usage-remove>` the selected rows.
ru: **Shift+Del** -- :ref:`удалить <usage-remove>` выделенные строки целиком.
